
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * azurerm_key_vault_secret.access_request_key


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.access_request_key must be replaced
-/+ resource "azurerm_key_vault_secret" "access_request_key" {
      ~ id                      = "https://lau-prod.vault.azure.net/secrets/access-backend-encryption-key/a7ea5b018ec142bdba24404af4168b5f" -> (known after apply)
      ~ name                    = "access-backend-encryption-key" -> "case-backend-encryption-key" # forces replacement
      ~ resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/lau-prod/providers/Microsoft.KeyVault/vaults/lau-prod/secrets/access-backend-encryption-key/versions/a7ea5b018ec142bdba24404af4168b5f" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/lau-prod/providers/Microsoft.KeyVault/vaults/lau-prod/secrets/access-backend-encryption-key" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "a7ea5b018ec142bdba24404af4168b5f" -> (known after apply)
      ~ versionless_id          = "https://lau-prod.vault.azure.net/secrets/access-backend-encryption-key" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":767,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->